comp-sci/lisp/mal-2.org
#+TITLE: MAL - Preliminaries
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+DATE: <2021-02-20T08:52:10-08:00>
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
#+INCLUDE: ../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
# Created Saturday February 20, 2021 at  8:52AM

* Overview

This contains a discussion of the implementation of data structures for
a Lisp interpreter. The focus will be on the data structures used for
the data types provided by the Lisp interpreter.

* Object Model = Tagged Union + Metadata

The basic data type for a simple Lisp implementation in C amounts to a
tagged union. Well, we stick the tag plus other metadata in an *"Object header"*
(borrowing the term from other languages, links below). The idea is we
have a "base class" type implemented as a =struct=

#+begin_src c
/* types.h */
typedef enum ObjectType {
    // ...
} ObjectType;

typedef struct Object {
    ObjectType type;
    // gc metadata
    // other metadata
} Object;
#+end_src

Note: we could (should) use bitfields to make the ~Object~ 1 word (4
bytes on 32-bit machines, 8 bytes on 64-bit machines). Otherwise, it
could end up multiple words in size (i.e., too big).

We then make the first field, in any type in our "object model", an
=Object= instance:

#+begin_example
struct Example {
    Object header;
    // ...
};
#+end_example

This takes advantage of C standards permitting casting a pointer to a
struct to (and from) a pointer to its first field. In other words, we
get a standards-compliant form of "polymorphism".

** Helper Functions

There are a number of functions we'll use for S-expressions generically,
like computing the hash code for an S-expression. (We could, further,
cache this as metadata in the ~struct Object~.)

#+begin_src c
/* types.h */
typedef int hash_t;

hash_t hashCode(Object *object);
bool equals(Object *lhs, Object *rhs);
#+end_src

The contracts we demand of these functions:
- Let ~Object *x, *y~ be non-null.
  If ~equals(x, y)~ is true, then ~hashCode(x) == hashCode(y)~.
  - We /do not/ require the [[https://en.wikipedia.org/wiki/Inverse_(logic)][inverse]] of this proposition --- i.e., we do
    not require if ~equals(x, y)~ is false, then ~hashCode(x) != hashCode(y)~.
- The ~equals()~ function is an equivalence relation, so
  - Reflexivity: for any non-null ~Object *x~, we have ~equals(x, x)~
  - Symmetry: for non-null ~Object *x, *y~, if ~equals(x, y)~, then
    ~equals(y, x)~
  - Transitivity: for non-null ~Object *x, *y, *z~, if ~equals(x, y)~ and
    ~equals(y, z)~, then we have ~equals(x, z)~
- Further, for any non-null =Object *x= and ~Object *null = NULL~,
  we have ~equals(x, NULL)~ and ~Object(x, null)~ both return false
- We have consistency:
  - ~equals()~: for any non-null ~Object *x, *y~ we have
    ~equals(x, y)~ return the same value if we compute it repeatedly
    without any other computation in between
  - ~hashCode()~: for any non-null ~Object *x~, we have ~hashCode(x)~
    return the same value if called repeatedly and no other computation
    occurs in between these calls
** Object Model References

- [[https://shipilev.net/jvm/objects-inside-out/][Java Objects Inside Out]]
- [[https://www.rubyguides.com/2017/04/memory-layout-of-an-object/][Ruby Internals: Exploring the Memory Layout of Ruby Objects]]
- [[https://devblogs.microsoft.com/premier-developer/managed-object-internals-part-4-fields-layout/][CLR (Managed object internals)]]
- [[https://docs.python.org/3/c-api/structures.html][Python Common Object Structures]]

* Atoms

There are two types of atoms: symbols and primitive values. The
primitive values are numbers, strings, booleans, or characters.
Symbols are associated to some value.

** Primitive Values

Primitive values would naively be represented by structures like:

#+begin_src c
/* types.h */
struct Int {
    Object header;
    int value;
};

struct Char {
    Object header;
    char codepoint;
};

struct Boolean {
    Object header;
    bool value;
};
#+end_src

These will be two words in size. There are tricks to compactify their
memory usage (NaN boxing, [[https://bernsteinbear.com/blog/small-objects/][tagged object pointers]] since x64 uses 48-bit
addresses giving us 16 bits of metadata).

