html/comp-sci/lisp/mal-2.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-04 Sun 18:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>MAL - Preliminaries</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">MAL - Preliminaries</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd02dceb">1. Overview</a></li>
<li><a href="#org89dd1a1">2. Object Model = Tagged Union + Metadata</a>
<ul>
<li><a href="#org5a651be">2.1. Helper Functions</a></li>
<li><a href="#org7e36b14">2.2. Object Model References</a></li>
</ul>
</li>
<li><a href="#orgfaaeef9">3. Atoms</a>
<ul>
<li><a href="#org237f801">3.1. Primitive Values</a></li>
<li><a href="#orgb048568">3.2. Strings</a>
<ul>
<li><a href="#orgae7399e">3.2.1. Constructor</a></li>
<li><a href="#orge902b80">3.2.2. Destructor</a></li>
<li><a href="#orgf124a8f">3.2.3. String Equality</a></li>
<li><a href="#org96bc4f1">3.2.4. Computing Hash Code</a></li>
<li><a href="#org5b772fc">3.2.5. References</a></li>
</ul>
</li>
<li><a href="#org7bd58b1">3.3. Symbols</a>
<ul>
<li><a href="#orgcb91c61">3.3.1. Constructor</a></li>
<li><a href="#org6df66c3">3.3.2. Destructor</a></li>
<li><a href="#org8236794">3.3.3. Hash Code</a></li>
<li><a href="#orgc1de4f5">3.3.4. Equality</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7160fa6">4. Linked Lists</a>
<ul>
<li><a href="#org1b7f3ac">4.1. Constructor</a></li>
<li><a href="#org79688ab">4.2. Destructor</a></li>
<li><a href="#orgecfe4e4">4.3. Hash Code</a></li>
<li><a href="#org674002e">4.4. Equality</a></li>
</ul>
</li>
<li><a href="#org2f2b1e4">5. Hash Tables</a>
<ul>
<li><a href="#orgf2d9454">5.1. Data Structures</a>
<ul>
<li><a href="#orga369383">5.1.1. Entry</a>
<ul>
<li><a href="#org9911880">5.1.1.1. Constructor</a></li>
<li><a href="#org62f756a">5.1.1.2. Destructor</a></li>
<li><a href="#orgd7d3f2c">5.1.1.3. Sorted Insertion</a></li>
</ul>
</li>
<li><a href="#org9216829">5.1.2. Hash Table</a></li>
</ul>
</li>
<li><a href="#orgd8565ad">5.2. Constructor</a></li>
<li><a href="#org09ef54e">5.3. Destructor</a></li>
<li><a href="#orgd4b4a43">5.4. Getting a Value for a Key</a></li>
<li><a href="#orgd5b13ba">5.5. Associating a Value for a Key</a>
<ul>
<li><a href="#orgf137986">5.5.1. Resizing the Entry Table</a></li>
<li><a href="#org087e12d">5.5.2. Transferring Table Contents</a></li>
</ul>
</li>
<li><a href="#orgb6dbe3c">5.6. Removing a key from the Hash Map</a></li>
<li><a href="#org790afa1">5.7. Size of the Hash Map</a></li>
<li><a href="#org651d8d1">5.8. Hash Code</a></li>
<li><a href="#orge6dba8f">5.9. Equality of Hash Maps</a></li>
<li><a href="#orgdde3b96">5.10. Hash Table References</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd02dceb" class="outline-2">
<h2 id="orgd02dceb"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This contains a discussion of the implementation of data structures for
a Lisp interpreter. The focus will be on the data structures used for
the data types provided by the Lisp interpreter.
</p>
</div>
</div>

<div id="outline-container-org89dd1a1" class="outline-2">
<h2 id="org89dd1a1"><span class="section-number-2">2</span> Object Model = Tagged Union + Metadata</h2>
<div class="outline-text-2" id="text-2">
<p>
The basic data type for a simple Lisp implementation in C amounts to a
tagged union. Well, we stick the tag plus other metadata in an <b>"Object header"</b>
(borrowing the term from other languages, links below). The idea is we
have a "base class" type implemented as a <code>struct</code>
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.h </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">typedef</span> <span class="org-keyword">enum</span> <span class="org-type">ObjectType</span> {
    <span class="org-comment-delimiter">// </span><span class="org-comment">...</span>
} <span class="org-type">ObjectType</span>;

<span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">Object</span> {
    <span class="org-type">ObjectType</span> <span class="org-variable-name">type</span>;
    <span class="org-comment-delimiter">// </span><span class="org-comment">gc metadata</span>
    <span class="org-comment-delimiter">// </span><span class="org-comment">other metadata</span>
} <span class="org-type">Object</span>;
</pre>
</div>

<p>
Note: we could (should) use bitfields to make the <code>Object</code> 1 word (4
bytes on 32-bit machines, 8 bytes on 64-bit machines). Otherwise, it
could end up multiple words in size (i.e., too big).
</p>

<p>
We then make the first field, in any type in our "object model", an
<code>Object</code> instance:
</p>

<pre class="example" id="org80c739b">
struct Example {
    Object header;
    // ...
};
</pre>

<p>
This takes advantage of C standards permitting casting a pointer to a
struct to (and from) a pointer to its first field. In other words, we
get a standards-compliant form of "polymorphism".
</p>
</div>

<div id="outline-container-org5a651be" class="outline-3">
<h3 id="org5a651be"><span class="section-number-3">2.1</span> Helper Functions</h3>
<div class="outline-text-3" id="text-2-1">
<p>
There are a number of functions we'll use for S-expressions generically,
like computing the hash code for an S-expression. (We could, further,
cache this as metadata in the <code>struct Object</code>.)
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.h </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">typedef</span> <span class="org-type">int</span> <span class="org-type">hash_t</span>;

<span class="org-type">hash_t</span> <span class="org-function-name">hashCode</span>(<span class="org-type">Object</span> *<span class="org-variable-name">object</span>);
<span class="org-type">bool</span> <span class="org-function-name">equals</span>(<span class="org-type">Object</span> *<span class="org-variable-name">lhs</span>, <span class="org-type">Object</span> *<span class="org-variable-name">rhs</span>);
</pre>
</div>

<p>
The contracts we demand of these functions:
</p>
<ul class="org-ul">
<li>Let <code>Object *x, *y</code> be non-null.
If <code>equals(x, y)</code> is true, then <code>hashCode(x) == hashCode(y)</code>.
<ul class="org-ul">
<li>We <i>do not</i> require the <a href="https://en.wikipedia.org/wiki/Inverse_(logic)">inverse</a> of this proposition &#x2014; i.e., we do
not require if <code>equals(x, y)</code> is false, then <code>hashCode(x) != hashCode(y)</code>.</li>
</ul></li>
<li>The <code>equals()</code> function is an equivalence relation, so
<ul class="org-ul">
<li>Reflexivity: for any non-null <code>Object *x</code>, we have <code>equals(x, x)</code></li>
<li>Symmetry: for non-null <code>Object *x, *y</code>, if <code>equals(x, y)</code>, then
<code>equals(y, x)</code></li>
<li>Transitivity: for non-null <code>Object *x, *y, *z</code>, if <code>equals(x, y)</code> and
<code>equals(y, z)</code>, then we have <code>equals(x, z)</code></li>
</ul></li>
<li>Further, for any non-null <code>Object *x</code> and <code>Object *null = NULL</code>,
we have <code>equals(x, NULL)</code> and <code>Object(x, null)</code> both return false</li>
<li>We have consistency:
<ul class="org-ul">
<li><code>equals()</code>: for any non-null <code>Object *x, *y</code> we have
<code>equals(x, y)</code> return the same value if we compute it repeatedly
without any other computation in between</li>
<li><code>hashCode()</code>: for any non-null <code>Object *x</code>, we have <code>hashCode(x)</code>
return the same value if called repeatedly and no other computation
occurs in between these calls</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org7e36b14" class="outline-3">
<h3 id="org7e36b14"><span class="section-number-3">2.2</span> Object Model References</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li><a href="https://shipilev.net/jvm/objects-inside-out/">Java Objects Inside Out</a></li>
<li><a href="https://www.rubyguides.com/2017/04/memory-layout-of-an-object/">Ruby Internals: Exploring the Memory Layout of Ruby Objects</a></li>
<li><a href="https://devblogs.microsoft.com/premier-developer/managed-object-internals-part-4-fields-layout/">CLR (Managed object internals)</a></li>
<li><a href="https://docs.python.org/3/c-api/structures.html">Python Common Object Structures</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfaaeef9" class="outline-2">
<h2 id="orgfaaeef9"><span class="section-number-2">3</span> Atoms</h2>
<div class="outline-text-2" id="text-3">
<p>
There are two types of atoms: symbols and primitive values. The
primitive values are numbers, strings, booleans, or characters.
Symbols are associated to some value.
</p>
</div>

<div id="outline-container-org237f801" class="outline-3">
<h3 id="org237f801"><span class="section-number-3">3.1</span> Primitive Values</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Primitive values would naively be represented by structures like:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.h </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">struct</span> <span class="org-type">Int</span> {
    <span class="org-type">Object</span> <span class="org-variable-name">header</span>;
    <span class="org-type">int</span> <span class="org-variable-name">value</span>;
};

<span class="org-keyword">struct</span> <span class="org-type">Char</span> {
    <span class="org-type">Object</span> <span class="org-variable-name">header</span>;
    <span class="org-type">char</span> <span class="org-variable-name">codepoint</span>;
};

<span class="org-keyword">struct</span> <span class="org-type">Boolean</span> {
    <span class="org-type">Object</span> <span class="org-variable-name">header</span>;
    <span class="org-type">bool</span> <span class="org-variable-name">value</span>;
};
</pre>
</div>

<p>
These will be two words in size. There are tricks to compactify their
memory usage (NaN boxing, <a href="https://bernsteinbear.com/blog/small-objects/">tagged object pointers</a> since x64 uses 48-bit
addresses giving us 16 bits of metadata).
</p>
</div>
</div>
