comp-sci/lisp/mal-2.org
** Strings

There are several different ways to represent a string. C uses a
null-terminated sequence of characters. Pascal uses length-prefixed
strings --- by convention, the first /k/ bytes are interpreted as an
integer, encoding the length of the string. C++ (and, I guess, Java)
encodes a string as a record (well, Java uses classes). We'll follow the
structure encoding:

#+begin_src c
/* types.h */
typedef struct String String;

String* string_new(char *str, int length);
void string_free(String **string);
bool string_isEqual(String *this, String *other);
hash_t string_hashCode(String *this);
#+end_src

The constructor =string_new= takes an additional parameter, ~length~,
which tells us how many characters to take from the source. The special
value of ~length < 0~ will copy until a null character is encountered.

The string API can be extended as necessary.

The data structure for a string would be implemented as:

#+begin_src c
/* types.c */
struct String {
    Object header;
    size_t length;
    char *text;
};
#+end_src

*** Constructor

The constructor copies the data from the given pointer. There are
basically three key moments to this constructor:
1. Allocate the memory for the string data structure
2. Initialize the length (which needs to be computed if the ~length~
   parameter is negative)
3. Allocate and initialize/copy the ~char[]~ array of text

#+begin_src c
/* types.c */

String* string_new(char *str, int length) {
    if (NULL == src) return NULL;

    String *string = alloc(sizeof(*string));
    string->header.type = TYPE_STRING;

    /* initialize length */
    if (length < 0) {
        string->length = strlen(str);
    } else {
        string->length = (size_t)length;
    }

    /* allocate and initialize text */
    string->text = alloc_array(string->length, sizeof(char));
    if (0 == string->length) {
        string->text = NULL;
    } else {
        memcpy(string->text, text, string->length);
    }
    return string;
}
#+end_src

*** Destructor

The destructor for a string needs to also free the underlying array of
characters. Then we free the data and metadata for the string object.
Finally we make sure to update the pointer to the string to point to NULL.

#+begin_src c
void string_free(String **this) {
    if ((NULL == this) || (NULL == *this)) return;

    if (NULL != (*this)->text) {
        free((*this)->text);
    }
    free((*this));
    *this = NULL;
}
#+end_src

*** String Equality

We can use a couple shortcuts to compute equality. First, if both
arguments are NULL pointers, then return true. But if only one is NULL,
return false.

The default case then moves on to non-null pointers. In that case, we
compare the lengths of the strings to rule out unequal strings quickly.
Should the strings have the same length, we compare the contents of the
underlying character array.

#+begin_src c
bool string_equals(String *lhs, String *rhs) {
    if (lhs == rhs) return true;
    if (NULL == lhs) return false;
    if (NULL == rhs) return false;
    if ((lhs->length) != (rhs->length)) return false;

    return 0 == memcmp(lhs->text, rhs->text, lhs->length);
}
#+end_src

*** Computing Hash Code

There are a number of ways to compute the hash code for a string.
Following the generic strategy of computing the hash code for a list
(discussed below), treating the String as a list of characters.
(If we wanted to borrow, e.g., Fowler--Noll--Vo hashing, we would
replace =h*31= by =h*FNV_prime=, and the addition by an XOR. The initial
value of the hash would be the =FNV_offset_basis=.)

#+begin_src c
hash_t string_hashCode(String *string) {
    if (NULL == string) return 0;
    if (0 == string->length) return 0;
    if (NULL == string->text) return 0;
    hash_t h = 0;
    for (size_t i = 0; i < string->length; i++) {
        h = h*31 + (hash_t)(string->text[i]);
    }
    return h;
}
#+end_src
*** References

- Java's ~String.java~ ([[https://github.com/openjdk/jdk/blob/jdk8-b120/jdk/src/share/classes/java/lang/String.java][jdk8-b120]], [[https://github.com/openjdk/jdk/blob/jdk7-b24/jdk/src/share/classes/java/lang/String.java][jdk7-b24]])

