html/comp-sci/lisp/mal-2.html

<div id="outline-container-orgb048568" class="outline-3">
<h3 id="orgb048568"><span class="section-number-3">3.2</span> Strings</h3>
<div class="outline-text-3" id="text-3-2">
<p>
There are several different ways to represent a string. C uses a
null-terminated sequence of characters. Pascal uses length-prefixed
strings &#x2014; by convention, the first <i>k</i> bytes are interpreted as an
integer, encoding the length of the string. C++ (and, I guess, Java)
encodes a string as a record (well, Java uses classes). We'll follow the
structure encoding:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.h </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">String</span> <span class="org-type">String</span>;

<span class="org-type">String</span>* <span class="org-function-name">string_new</span>(<span class="org-type">char</span> *<span class="org-variable-name">str</span>, <span class="org-type">int</span> <span class="org-variable-name">length</span>);
<span class="org-type">void</span> <span class="org-function-name">string_free</span>(<span class="org-type">String</span> **<span class="org-variable-name">string</span>);
<span class="org-type">bool</span> <span class="org-function-name">string_isEqual</span>(<span class="org-type">String</span> *<span class="org-variable-name">this</span>, <span class="org-type">String</span> *<span class="org-variable-name">other</span>);
<span class="org-type">hash_t</span> <span class="org-function-name">string_hashCode</span>(<span class="org-type">String</span> *<span class="org-variable-name">this</span>);
</pre>
</div>

<p>
The constructor <code>string_new</code> takes an additional parameter, <code>length</code>,
which tells us how many characters to take from the source. The special
value of <code>length &lt; 0</code> will copy until a null character is encountered.
</p>

<p>
The string API can be extended as necessary.
</p>

<p>
The data structure for a string would be implemented as:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">struct</span> <span class="org-type">String</span> {
    <span class="org-type">Object</span> <span class="org-variable-name">header</span>;
    <span class="org-type">size_t</span> <span class="org-variable-name">length</span>;
    <span class="org-type">char</span> *<span class="org-variable-name">text</span>;
};
</pre>
</div>
</div>

<div id="outline-container-orgae7399e" class="outline-4">
<h4 id="orgae7399e"><span class="section-number-4">3.2.1</span> Constructor</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
The constructor copies the data from the given pointer. There are
basically three key moments to this constructor:
</p>
<ol class="org-ol">
<li>Allocate the memory for the string data structure</li>
<li>Initialize the length (which needs to be computed if the <code>length</code>
parameter is negative)</li>
<li>Allocate and initialize/copy the <code>char[]</code> array of text</li>
</ol>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">String</span>* <span class="org-function-name">string_new</span>(<span class="org-type">char</span> *<span class="org-variable-name">str</span>, <span class="org-type">int</span> <span class="org-variable-name">length</span>) {
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == src) <span class="org-keyword">return</span> <span class="org-constant">NULL</span>;

    <span class="org-type">String</span> *<span class="org-variable-name">string</span> = alloc(<span class="org-keyword">sizeof</span>(*string));
    string-&gt;header.type = TYPE_STRING;

    <span class="org-comment-delimiter">/* </span><span class="org-comment">initialize length </span><span class="org-comment-delimiter">*/</span>
    <span class="org-keyword">if</span> (length &lt; 0) {
        string-&gt;length = strlen(str);
    } <span class="org-keyword">else</span> {
        string-&gt;length = (<span class="org-type">size_t</span>)length;
    }

    <span class="org-comment-delimiter">/* </span><span class="org-comment">allocate and initialize text </span><span class="org-comment-delimiter">*/</span>
    string-&gt;text = alloc_array(string-&gt;length, <span class="org-keyword">sizeof</span>(<span class="org-type">char</span>));
    <span class="org-keyword">if</span> (0 == string-&gt;length) {
        string-&gt;text = <span class="org-constant">NULL</span>;
    } <span class="org-keyword">else</span> {
        memcpy(string-&gt;text, text, string-&gt;length);
    }
    <span class="org-keyword">return</span> string;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge902b80" class="outline-4">
<h4 id="orge902b80"><span class="section-number-4">3.2.2</span> Destructor</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
The destructor for a string needs to also free the underlying array of
characters. Then we free the data and metadata for the string object.
Finally we make sure to update the pointer to the string to point to NULL.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">string_free</span>(<span class="org-type">String</span> **<span class="org-variable-name">this</span>) {
    <span class="org-keyword">if</span> ((<span class="org-constant">NULL</span> == this) || (<span class="org-constant">NULL</span> == *this)) <span class="org-keyword">return</span>;

    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> != (*this)-&gt;text) {
        free((*this)-&gt;text);
    }
    free((*this));
    *this = <span class="org-constant">NULL</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf124a8f" class="outline-4">
<h4 id="orgf124a8f"><span class="section-number-4">3.2.3</span> String Equality</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
We can use a couple shortcuts to compute equality. First, if both
arguments are NULL pointers, then return true. But if only one is NULL,
return false.
</p>

<p>
The default case then moves on to non-null pointers. In that case, we
compare the lengths of the strings to rule out unequal strings quickly.
Should the strings have the same length, we compare the contents of the
underlying character array.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">bool</span> <span class="org-function-name">string_equals</span>(<span class="org-type">String</span> *<span class="org-variable-name">lhs</span>, <span class="org-type">String</span> *<span class="org-variable-name">rhs</span>) {
    <span class="org-keyword">if</span> (lhs == rhs) <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == lhs) <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == rhs) <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    <span class="org-keyword">if</span> ((lhs-&gt;length) != (rhs-&gt;length)) <span class="org-keyword">return</span> <span class="org-constant">false</span>;

    <span class="org-keyword">return</span> 0 == memcmp(lhs-&gt;text, rhs-&gt;text, lhs-&gt;length);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org96bc4f1" class="outline-4">
<h4 id="org96bc4f1"><span class="section-number-4">3.2.4</span> Computing Hash Code</h4>
<div class="outline-text-4" id="text-3-2-4">
<p>
There are a number of ways to compute the hash code for a string.
Following the generic strategy of computing the hash code for a list
(discussed below), treating the String as a list of characters.
(If we wanted to borrow, e.g., Fowler&#x2013;Noll&#x2013;Vo hashing, we would
replace <code>h*31</code> by <code>h*FNV_prime</code>, and the addition by an XOR. The initial
value of the hash would be the <code>FNV_offset_basis</code>.)
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">hash_t</span> <span class="org-function-name">string_hashCode</span>(<span class="org-type">String</span> *<span class="org-variable-name">string</span>) {
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == string) <span class="org-keyword">return</span> 0;
    <span class="org-keyword">if</span> (0 == string-&gt;length) <span class="org-keyword">return</span> 0;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == string-&gt;text) <span class="org-keyword">return</span> 0;
    <span class="org-type">hash_t</span> <span class="org-variable-name">h</span> = 0;
    <span class="org-keyword">for</span> (<span class="org-type">size_t</span> <span class="org-variable-name">i</span> = 0; i &lt; string-&gt;length; i++) {
        h = h*31 + (<span class="org-type">hash_t</span>)(string-&gt;text[i]);
    }
    <span class="org-keyword">return</span> h;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5b772fc" class="outline-4">
<h4 id="org5b772fc"><span class="section-number-4">3.2.5</span> References</h4>
<div class="outline-text-4" id="text-3-2-5">
<ul class="org-ul">
<li>Java's <code>String.java</code> (<a href="https://github.com/openjdk/jdk/blob/jdk8-b120/jdk/src/share/classes/java/lang/String.java">jdk8-b120</a>, <a href="https://github.com/openjdk/jdk/blob/jdk7-b24/jdk/src/share/classes/java/lang/String.java">jdk7-b24</a>)</li>
</ul>
</div>
</div>
</div>
