comp-sci/lisp/mal-2.org
** Symbols

We intern symbols to make at most one object which corresponds with a
symbol name. This could be done using a Hash Table, a binary tree, or
some other data structure.

#+begin_src c
/* types.h */
typedef struct Symbol Symbol;

Symbol* intern(char *name);
void symbol_free(Symbol **symbol);
hash_t symbol_hashCode(Symbol *this);
#+end_src

Again, we are using opaque pointers (since it's good style):

#+begin_src c
/* types.c */

struct Symbol {
    Object header;
    String *name;
};
#+end_src

The contract is, for any non-empty strings =x= and =y= such that they
are equal (in the sense that ~0 == strcmp(x, y)~),
then we have ~intern(x) == intern(y)~
and specifically
~intern(x) != NULL~.

*** Constructor

The trick to this is we will use a Hash Table to lookup the symbol with
a given name. If it exists, we return that; otherwise, we create a new
Symbol object, save it in the Hash Table, and return the Symbol object.

One word of warning: if we extend our interpreter to include
multithreading, then we must make sure our HashMap is concurrent.
Otherwise, we may end up with race conditions regarding the =symbol_table=.

#+begin_src c
static HashMap *symbol_table = NULL;

static void init_symbol_table() {
    if (NULL == symbol_table) {
        symbol_table = hashmap_new();
    }
}

static Symbol* symbol_new(String *name) {
    Symbol *symbol = alloc(sizeof(*symbol));
    symbol->header.type = TYPE_SYMBOL;
    symbol->name = name;
    return symbol;
}

Symbol* intern(char *name) {
    init_symbol_table();
    String *key = string_new(name, -1);
    Symbol *symbol = hashmap_get(&symbol_table, key);

    if (NULL == symbol) {
        symbol = symbol_name(key);
        hashmap_put(&symbol_table, key, symbol);
    } else {
        // cache hit
        string_free(&key);
    }
    return symbol;
}
#+end_src

*** Destructor

I'm not sure I need this, exactly. But I'll vacate the symbol table, and
delete the symbol and its underlying string.

#+begin_src c
void symbol_free(Symbol **symbol) {
    if ((NULL == symbol) || (NULL == *symbol)) return;
    hashmap_remove(symbol_table, (*symbol)->name);
    string->free(&((*symbol)->name));
    free(*symbol);
    (*symbol) = NULL;
}
#+end_src

*** Hash Code

The hash code for a symbol amounts to computing the hash code for the
associated string.

#+begin_src c
hash_t symbol_hashCode(Symbol *symbol) {
    if (NULL == symbol) return 0;
    return string_hashCode(symbol->name);
}
#+end_src

*** Equality

Since we're interning symbols, we could use pointer equality. But
ostensibly we'll extend symbols to a multithreaded environment...so we
could end up in a tricky situation where pointer comparison does not
work.

#+begin_src c
bool symbol_equals(Symbol *lhs, Symbol *rhs) {
    if (lhs == rhs) return true;
    if (NULL == lhs) return false;
    if (NULL == rhs) return true;

#if defined(MULTITHREADED_PARANOID)
#if MULTITHREADED_PARANOID
    return string_equals(lhs->name, rhs->name);
#endif /* MULTITHREADED_PARANOID */
#else
    return false;
#endif /* defined(MULTITHREADED_PARANOID) */
}
#+end_src

* Linked Lists

Also called "cons cells", linked lists are what you'd expect. They're
the only data type with pointers, so far.

#+begin_src c
/* types.h */
typedef struct Cons Cons;

Cons* cons_new(Object *car, Object *cdr);
void cons_free(Cons **this);
hash_t cons_hashCode(Cons *this);
#+end_src

The opaque pointer refers to:

#+begin_src c
/* types.c */
struct Cons {
    Object header;
    Object **car;
    Object **cdr;
};
#define safe_car(cell) (NULL == (cell)->car ? NULL : *((cell)->car))
#define safe_cdr(cell) (NULL == (cell)->cdr ? NULL : *((cell)->cdr))
#+end_src

Why use double pointers? Well, really, we should think of
=typedef struct Object* ObjectRef=, and a cons-cell consists of a
pointer to an =ObjectRef=. When we free the memory for the object
pointed by the =ObjectRef=, we update the =ObjectRef= to be null. This
requires using double pointers for this update to persist.

