html/comp-sci/lisp/mal-2.html

<div id="outline-container-org7bd58b1" class="outline-3">
<h3 id="org7bd58b1"><span class="section-number-3">3.3</span> Symbols</h3>
<div class="outline-text-3" id="text-3-3">
<p>
We intern symbols to make at most one object which corresponds with a
symbol name. This could be done using a Hash Table, a binary tree, or
some other data structure.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.h </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">Symbol</span> <span class="org-type">Symbol</span>;

<span class="org-type">Symbol</span>* <span class="org-function-name">intern</span>(<span class="org-type">char</span> *<span class="org-variable-name">name</span>);
<span class="org-type">void</span> <span class="org-function-name">symbol_free</span>(<span class="org-type">Symbol</span> **<span class="org-variable-name">symbol</span>);
<span class="org-type">hash_t</span> <span class="org-function-name">symbol_hashCode</span>(<span class="org-type">Symbol</span> *<span class="org-variable-name">this</span>);
</pre>
</div>

<p>
We make public the <code>symbol_free()</code> function, though we may want to hide
it, and make some method to register it with the garbage collector
hidden from the user.
</p>

<p>
Again, we are using opaque pointers (since it's good style):
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-keyword">struct</span> <span class="org-type">Symbol</span> {
    <span class="org-type">Object</span> <span class="org-variable-name">header</span>;
    <span class="org-type">String</span> *<span class="org-variable-name">name</span>;
};
</pre>
</div>

<p>
The contract is, for any non-empty strings <code>x</code> and <code>y</code> such that they
are equal (in the sense that <code>0 == strcmp(x, y)</code>),
then we have <code>intern(x) == intern(y)</code>
and specifically
<code>intern(x) != NULL</code>.
</p>
</div>

<div id="outline-container-orgcb91c61" class="outline-4">
<h4 id="orgcb91c61"><span class="section-number-4">3.3.1</span> Constructor</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
The trick to this is we will use a Hash Table to lookup the symbol with
a given name. If it exists, we return that; otherwise, we create a new
Symbol object, save it in the Hash Table, and return the Symbol object.
</p>

<p>
One word of warning: if we extend our interpreter to include
multithreading, then we must make sure our HashMap is concurrent.
Otherwise, we may end up with race conditions regarding the <code>symbol_table</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-keyword">static</span> <span class="org-type">HashMap</span> *<span class="org-variable-name">symbol_table</span> = <span class="org-constant">NULL</span>;

<span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">init_symbol_table</span>() {
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == symbol_table) {
        symbol_table = hashmap_new();
    }
}

<span class="org-keyword">static</span> <span class="org-type">Symbol</span>* <span class="org-function-name">symbol_new</span>(<span class="org-type">String</span> *<span class="org-variable-name">name</span>) {
    <span class="org-type">Symbol</span> *<span class="org-variable-name">symbol</span> = alloc(<span class="org-keyword">sizeof</span>(*symbol));
    symbol-&gt;header.type = TYPE_SYMBOL;
    symbol-&gt;name = name;
    <span class="org-keyword">return</span> symbol;
}

<span class="org-type">Symbol</span>* <span class="org-function-name">intern</span>(<span class="org-type">char</span> *<span class="org-variable-name">name</span>) {
    init_symbol_table();
    <span class="org-type">String</span> *<span class="org-variable-name">key</span> = string_new(name, -1);
    <span class="org-type">Symbol</span> *<span class="org-variable-name">symbol</span> = hashmap_get(&amp;symbol_table, key);

    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == symbol) {
        symbol = symbol_name(key);
        hashmap_put(&amp;symbol_table, key, symbol);
    } <span class="org-keyword">else</span> {
        <span class="org-comment-delimiter">// </span><span class="org-comment">cache hit</span>
        string_free(&amp;key);
    }
    <span class="org-keyword">return</span> symbol;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6df66c3" class="outline-4">
<h4 id="org6df66c3"><span class="section-number-4">3.3.2</span> Destructor</h4>
<div class="outline-text-4" id="text-3-3-2">
<p>
I'm not sure I need this, exactly. But I'll vacate the symbol table, and
delete the symbol and its underlying string.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">void</span> <span class="org-function-name">symbol_free</span>(<span class="org-type">Symbol</span> **<span class="org-variable-name">symbol</span>) {
    <span class="org-keyword">if</span> ((<span class="org-constant">NULL</span> == symbol) || (<span class="org-constant">NULL</span> == *symbol)) <span class="org-keyword">return</span>;
    hashmap_remove(symbol_table, (*symbol)-&gt;name);
    string-&gt;free(&amp;((*symbol)-&gt;name));
    free(*symbol);
    (*symbol) = <span class="org-constant">NULL</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8236794" class="outline-4">
<h4 id="org8236794"><span class="section-number-4">3.3.3</span> Hash Code</h4>
<div class="outline-text-4" id="text-3-3-3">
<p>
The hash code for a symbol amounts to computing the hash code for the
associated string.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">hash_t</span> <span class="org-function-name">symbol_hashCode</span>(<span class="org-type">Symbol</span> *<span class="org-variable-name">symbol</span>) {
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == symbol) <span class="org-keyword">return</span> 0;
    <span class="org-keyword">return</span> string_hashCode(symbol-&gt;name);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1de4f5" class="outline-4">
<h4 id="orgc1de4f5"><span class="section-number-4">3.3.4</span> Equality</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
Since we're interning symbols, we could use pointer equality. But
ostensibly we'll extend symbols to a multithreaded environment&#x2026;so we
could end up in a tricky situation where pointer comparison does not
work.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-type">bool</span> <span class="org-function-name">symbol_equals</span>(<span class="org-type">Symbol</span> *<span class="org-variable-name">lhs</span>, <span class="org-type">Symbol</span> *<span class="org-variable-name">rhs</span>) {
    <span class="org-keyword">if</span> (lhs == rhs) <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == lhs) <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == rhs) <span class="org-keyword">return</span> <span class="org-constant">true</span>;

<span class="org-preprocessor">#if</span> <span class="org-preprocessor">defined</span>(MULTITHREADED_PARANOID)
<span class="org-preprocessor">#if</span> MULTITHREADED_PARANOID
    <span class="org-keyword">return</span> string_equals(lhs-&gt;name, rhs-&gt;name);
<span class="org-preprocessor">#endif</span> <span class="org-comment-delimiter">/* </span><span class="org-comment">MULTITHREADED_PARANOID </span><span class="org-comment-delimiter">*/</span>
<span class="org-preprocessor">#else</span>
    <span class="org-keyword">return</span> <span class="org-constant">false</span>;
<span class="org-preprocessor">#endif</span> <span class="org-comment-delimiter">/* </span><span class="org-comment">defined(MULTITHREADED_PARANOID) </span><span class="org-comment-delimiter">*/</span>
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org7160fa6" class="outline-2">
<h2 id="org7160fa6"><span class="section-number-2">4</span> Linked Lists</h2>
<div class="outline-text-2" id="text-4">
<p>
Also called "cons cells", linked lists are what you'd expect. They're
the only data type with pointers, so far.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.h </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">Cons</span> <span class="org-type">Cons</span>;

<span class="org-type">Cons</span>* <span class="org-function-name">cons_new</span>(<span class="org-type">Object</span> *<span class="org-variable-name">car</span>, <span class="org-type">Object</span> *<span class="org-variable-name">cdr</span>);
<span class="org-type">void</span> <span class="org-function-name">cons_free</span>(<span class="org-type">Cons</span> **<span class="org-variable-name">this</span>);
<span class="org-type">hash_t</span> <span class="org-function-name">cons_hashCode</span>(<span class="org-type">Cons</span> *<span class="org-variable-name">this</span>);
</pre>
</div>

<p>
The opaque pointer refers to:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">struct</span> <span class="org-type">Cons</span> {
    <span class="org-type">Object</span> <span class="org-variable-name">header</span>;
    <span class="org-type">Object</span> **<span class="org-variable-name">car</span>;
    <span class="org-type">Object</span> **<span class="org-variable-name">cdr</span>;
};
<span class="org-preprocessor">#define</span> <span class="org-function-name">safe_car</span>(<span class="org-variable-name">cell</span>) (<span class="org-constant">NULL</span> == (cell)-&gt;car ? <span class="org-constant">NULL</span> : *((cell)-&gt;car))
<span class="org-preprocessor">#define</span> <span class="org-function-name">safe_cdr</span>(<span class="org-variable-name">cell</span>) (<span class="org-constant">NULL</span> == (cell)-&gt;cdr ? <span class="org-constant">NULL</span> : *((cell)-&gt;cdr))
</pre>
</div>

<p>
Why use double pointers? Well, really, we should think of
<code>typedef struct Object* ObjectRef</code>, and a cons-cell consists of a
pointer to an <code>ObjectRef</code>. When we free the memory for the object
pointed by the <code>ObjectRef</code>, we update the <code>ObjectRef</code> to be null. This
requires using double pointers for this update to persist.
</p>
</div>
