comp-sci/lisp/mal-2.org
** Constructor

The constructor works as we would expect: allocate the memory for the
header and addresses. If one of the arguments is NULL, then its double
pointer will point to NULL.

#+begin_src c
Cons* cons_new(Object *car, Object *cdr) {
    Cons *cell = alloc(sizeof(*cell));
    cell->header.type = TYPE_CONS;
    cell->car = (NULL == car) ? NULL : &car;
    cell->cdr = (NULL == cdr) ? NULL : &cdr;
    return cell;
}
#+end_src

** Destructor

This requires a bit more care. We'll iterate through the list,
recursively freeing the car and cdr, before finally freeing the wrapper
and metadata for the Cons cell itself.

#+begin_src c
void cons_free(Cons **this) {
    if ((NULL == this) || (NULL == *this)) return;
    obj_free((*this)->car);
    //@ assert (\null == \old(*this)->car) || (\null == *((*this)->car));
    obj_free((*this)->cdr);
    //@ assert (\null == \old(*this)->cdr) || (\null == *((*this)->cdr));
    free(*this);
    (*this) = NULL;
}
#+end_src
** Hash Code

The basic computation amounts to

#+begin_example
hash_t list_hashCode(List *this) {
    hash_t hashCode = 1;
    for (Elt e : this)
        hashCode = 31*hashCode + ((NULL == e) ? 0 : hashCode(e));
    return hashCode;
}
#+end_example

The actual source  code implementation needs to handle the special case
where ~cell == nil~, when it should be zero.

#+begin_src c
hash_t cons_hashCode(Cons *cell) {
    if (NULL == cell) return 0;

    hash_t h = 1;
    Object *car = safe_car(cell);
    Object *cdr = safe_cdr(cell);

    if ((NULL == car) && (NULL == cdr)) {
        h = 0;
    } else {
        h = 31*h + hashCode(car);
        h = 31*h + hashCode(cdr);
    }
    return h;
}
#+end_src

** Equality

We test for equality by checking the car of the left-hand side equals
the car of the right-hand side, and the cdr of both sides are equal.
Component-wise equality, in other words.

#+begin_src c
bool cons_equals(Cons *lhs, Cons *rhs) {
    if (lhs == rhs) return true;
    if (NULL == lhs) return false;
    if (NULL == rhs) return false;

    if (equals(safe_car(lhs), safe_car(rhs))) {
        return equals(safe_cdr(lhs), safe_cdr(rhs));
    }
    return false;
}
#+end_src

* Hash Tables

There are many different implementations. Basically the difference boils
down to using "chaining" (the buckets are a linked list --- Java did
this prior to version 8) or [[https://en.wikipedia.org/wiki/Open_addressing]["open addressing"]].

Some implementations don't require hash tables, but there are two
reasons I'm including them. The first, Common Lisp provides them. The
second, we can use them as the data structure for the environment
(dictionary binding symbols to their values).

Arguably, we could implement hash tables using cons-cells and atomic
types. In fact, that's what most Common Lisp implementations /do/.

We will implement a Hash Table in C.

#+begin_src c
/* types.h */
typedef struct HashMap HashMap;

HashMap* hashmap_new();
void hashmap_free(HashMap **this);
hash_t hashmap_hashCode(HashMap *this);
bool hashmap_equals(HashMap **lhs, HashMap **rhs);
Object* hashmap_get(HashMap *this, Object *key);
Object* hashmap_put(HashMap *this, Object *key, Object *value);
void hashmap_remove(HashMap *this, Object *key);
size_t hashmap_size(HashMap *this);
#+end_src

Arguably, there may be other functions to consider implementing.

** Data Structures

We will use simple chaining. The idea is to use an array of buckets (a
bucket is a linked list of "Entries" --- key-value pairs plus some extra metadata),
associating a key-value pair to exactly one bucket. When there are too
many entries, we increase the number of buckets, then rebalance the
entries.

*** Entry

An entry is a data structure with some extra metadata, namely the hash
code for the key (so we compute it once).

#+begin_src c
/* types.c */

typedef struct Entry {
    Object *key;
    Object *value;
    hash_t hash;
    struct Entry *next;
} Entry;
#+end_src

