html/comp-sci/lisp/mal-2.html

<div id="outline-container-org1b7f3ac" class="outline-3">
<h3 id="org1b7f3ac"><span class="section-number-3">4.1</span> Constructor</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The constructor works as we would expect: allocate the memory for the
header and addresses. If one of the arguments is NULL, then its double
pointer will point to NULL.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>
<span class="org-type">Cons</span>* <span class="org-function-name">cons_new</span>(<span class="org-type">Object</span> *<span class="org-variable-name">car</span>, <span class="org-type">Object</span> *<span class="org-variable-name">cdr</span>) {
    <span class="org-type">Cons</span> *<span class="org-variable-name">cell</span> = alloc(<span class="org-keyword">sizeof</span>(*cell));
    cell-&gt;header.type = TYPE_CONS;
    cell-&gt;car = (<span class="org-constant">NULL</span> == car) ? <span class="org-constant">NULL</span> : &amp;car;
    cell-&gt;cdr = (<span class="org-constant">NULL</span> == cdr) ? <span class="org-constant">NULL</span> : &amp;cdr;
    <span class="org-keyword">return</span> cell;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org79688ab" class="outline-3">
<h3 id="org79688ab"><span class="section-number-3">4.2</span> Destructor</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This requires a bit more care. We'll iterate through the list,
recursively freeing the car and cdr, before finally freeing the wrapper
and metadata for the Cons cell itself.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>
<span class="org-type">void</span> <span class="org-function-name">cons_free</span>(<span class="org-type">Cons</span> **<span class="org-variable-name">this</span>) {
    <span class="org-keyword">if</span> ((<span class="org-constant">NULL</span> == this) || (<span class="org-constant">NULL</span> == *this)) <span class="org-keyword">return</span>;
    obj_free((*this)-&gt;car);
    <span class="org-comment-delimiter">//</span><span class="org-comment">@ assert (\null == \old(*this)-&gt;car) || (\null == *((*this)-&gt;car));</span>
    obj_free((*this)-&gt;cdr);
    <span class="org-comment-delimiter">//</span><span class="org-comment">@ assert (\null == \old(*this)-&gt;cdr) || (\null == *((*this)-&gt;cdr));</span>
    free(*this);
    (*this) = <span class="org-constant">NULL</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgecfe4e4" class="outline-3">
<h3 id="orgecfe4e4"><span class="section-number-3">4.3</span> Hash Code</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The basic computation amounts to
</p>

<pre class="example" id="orgd9b68b9">
hash_t list_hashCode(List *this) {
    hash_t hashCode = 1;
    for (Elt e : this)
        hashCode = 31*hashCode + ((NULL == e) ? 0 : hashCode(e));
    return hashCode;
}
</pre>

<p>
The actual source  code implementation needs to handle the special case
where <code>cell == nil</code>, when it should be zero.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>
<span class="org-type">hash_t</span> <span class="org-function-name">cons_hashCode</span>(<span class="org-type">Cons</span> *<span class="org-variable-name">cell</span>) {
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == cell) <span class="org-keyword">return</span> 0;

    <span class="org-type">hash_t</span> <span class="org-variable-name">h</span> = 1;
    <span class="org-type">Object</span> *<span class="org-variable-name">car</span> = safe_car(cell);
    <span class="org-type">Object</span> *<span class="org-variable-name">cdr</span> = safe_cdr(cell);

    <span class="org-keyword">if</span> ((<span class="org-constant">NULL</span> == car) &amp;&amp; (<span class="org-constant">NULL</span> == cdr)) {
        h = 0;
    } <span class="org-keyword">else</span> {
        h = 31*h + hashCode(car);
        h = 31*h + hashCode(cdr);
    }
    <span class="org-keyword">return</span> h;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org674002e" class="outline-3">
<h3 id="org674002e"><span class="section-number-3">4.4</span> Equality</h3>
<div class="outline-text-3" id="text-4-4">
<p>
We test for equality by checking the car of the left-hand side equals
the car of the right-hand side, and the cdr of both sides are equal.
Component-wise equality, in other words.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>
<span class="org-type">bool</span> <span class="org-function-name">cons_equals</span>(<span class="org-type">Cons</span> *<span class="org-variable-name">lhs</span>, <span class="org-type">Cons</span> *<span class="org-variable-name">rhs</span>) {
    <span class="org-keyword">if</span> (lhs == rhs) <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == lhs) <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == rhs) <span class="org-keyword">return</span> <span class="org-constant">false</span>;

    <span class="org-keyword">if</span> (equals(safe_car(lhs), safe_car(rhs))) {
        <span class="org-keyword">return</span> equals(safe_cdr(lhs), safe_cdr(rhs));
    }
    <span class="org-keyword">return</span> <span class="org-constant">false</span>;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2f2b1e4" class="outline-2">
<h2 id="org2f2b1e4"><span class="section-number-2">5</span> Hash Tables</h2>
<div class="outline-text-2" id="text-5">
<p>
There are many different implementations. Basically the difference boils
down to using "chaining" (the buckets are a linked list &#x2014; Java did
this prior to version 8) or <a href="https://en.wikipedia.org/wiki/Open_addressing">"open addressing"</a>.
</p>

<p>
Some implementations don't require hash tables, but there are two
reasons I'm including them. The first, Common Lisp provides them. The
second, we can use them as the data structure for the environment
(dictionary binding symbols to their values).
</p>

<p>
Arguably, we could implement hash tables using cons-cells and atomic
types. In fact, that's what most Common Lisp implementations <i>do</i>.
</p>

<p>
We will implement a Hash Table in C.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.h </span><span class="org-comment-delimiter">*/</span>
<span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">HashMap</span> <span class="org-type">HashMap</span>;

<span class="org-type">HashMap</span>* <span class="org-function-name">hashmap_new</span>();
<span class="org-type">void</span> <span class="org-function-name">hashmap_free</span>(<span class="org-type">HashMap</span> **<span class="org-variable-name">this</span>);
<span class="org-type">hash_t</span> <span class="org-function-name">hashmap_hashCode</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>);
<span class="org-type">bool</span> <span class="org-function-name">hashmap_equals</span>(<span class="org-type">HashMap</span> **<span class="org-variable-name">lhs</span>, <span class="org-type">HashMap</span> **<span class="org-variable-name">rhs</span>);
<span class="org-type">Object</span>* <span class="org-function-name">hashmap_get</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>, <span class="org-type">Object</span> *<span class="org-variable-name">key</span>);
<span class="org-type">Object</span>* <span class="org-function-name">hashmap_put</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>, <span class="org-type">Object</span> *<span class="org-variable-name">key</span>, <span class="org-type">Object</span> *<span class="org-variable-name">value</span>);
<span class="org-type">void</span> <span class="org-function-name">hashmap_remove</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>, <span class="org-type">Object</span> *<span class="org-variable-name">key</span>);
<span class="org-type">size_t</span> <span class="org-function-name">hashmap_size</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>);
</pre>
</div>

<p>
Arguably, there may be other functions to consider implementing.
</p>
</div>

<div id="outline-container-orgf2d9454" class="outline-3">
<h3 id="orgf2d9454"><span class="section-number-3">5.1</span> Data Structures</h3>
<div class="outline-text-3" id="text-5-1">
<p>
We will use simple chaining. The idea is to use an array of buckets (a
bucket is a linked list of "Entries" &#x2014; key-value pairs plus some extra metadata),
associating a key-value pair to exactly one bucket. When there are too
many entries, we increase the number of buckets, then rebalance the
entries.
</p>
</div>

<div id="outline-container-orga369383" class="outline-4">
<h4 id="orga369383"><span class="section-number-4">5.1.1</span> Entry</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
An entry is a data structure with some extra metadata, namely the hash
code for the key (so we compute it once).
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> <span class="org-type">Entry</span> {
    <span class="org-type">Object</span> *<span class="org-variable-name">key</span>;
    <span class="org-type">Object</span> *<span class="org-variable-name">value</span>;
    <span class="org-type">hash_t</span> <span class="org-variable-name">hash</span>;
    <span class="org-keyword">struct</span> <span class="org-type">Entry</span> *<span class="org-variable-name">next</span>;
} <span class="org-type">Entry</span>;
</pre>
</div>
</div>
