comp-sci/lisp/mal-2.org
**** Constructor

We have the usual boiler plate code for it, namely a constructor and
destructor.

#+begin_src c
/* types.c */

Entry* entry_new(Object *key, Object *value, hash_t hash) {
    Entry *entry = alloc(sizeof(*entry));
    entry->key = key;
    entry->value = value;
    entry->next = NULL;
    entry->hash = hash;
    return entry;
}
#+end_src

**** Destructor

The only nuance to the Entry data structure is, unlike a Cons cell, its
destructor will not recursively destroy its next Entry.

#+begin_src c
/* types.c */

void entry_free(Entry **entry) {
    if ((NULL == entry) || (NULL == *entry)) return;

    free(*entry);
    (*entry) = NULL;
}
#+end_src

**** Sorted Insertion

Given a pointer to (a pointer to) an entry, and an entry we wish to
insert into the linked list, insert the new entry in a manner that the
linked list is sorted by hash code.

#+begin_src c
void entry_insert(Entry **list, Entry *entry) {
    assert(NULL != entry);
    if (NULL == list) return;
    if (NULL == *list) {
        (*list) = entry;
        entry->next = NULL;
        return;
    } else if ((entry->hash) <= ((*list)->hash)) {
        entry->next = (*list);
        (*list) = entry;
        return;
    } else {
        assert((entry->hash) > ((*list)->hash));
        Entry *prev = *item;
        Entry *e = NULL;
        for (e = prev->next; NULL != *e; e = e->next) {
            // if (prev < entry <= e)
            if (((prev->hash) < (entry->hash)) &&
                ((entry->hash) <= (e->hash))) {
                prev->next = entry;
                entry->next = e;
                return;
            }
            prev = e;
        }
        // append at the end of the linked list
        assert(NULL == e);
        assert(NULL != prev);
        prev->next = entry;
        entry->next = NULL;
    }
}
#+end_src

*** Hash Table

The Hash Map consists of an array of Entry pointers. We track how many
entries belong to the hash map in its =size= parameter; and when it
exceeds the =capacity=, we grow the number of buckets and rebalance.

#+begin_src c
/* types.c */

struct HashMap {
    Object header;
    Entry **table;
    size_t capacity;
    size_t size;
};
#+end_src

** Constructor

The constructor expects no parameters. The default capacity for a hash
map would be 16, its initial size 0.

#+begin_src c
/* types.c */

HashMap* hashmap_new() {
    HashMap *map = alloc(sizeof(*map));
    map->header.type = TYPE_HASH_MAP;
    map->capacity = INITIAL_HASH_MAP_CAPACITY;
    map->size = 0;
    map->table = alloc_array(sizeof(struct Entry*), map->capacity);
    return map;
}
#+end_src

** Destructor

When we destroy a HashMap object, we also have to iteratively destroy
the table entries.

#+begin_src c
/* types.c */

void hashmap_free(HashMap **this) {
    if ((NULL == this) || (NULL == *this)) return;

    for (size_t row = 0; row < (*this)->capacity; row++) {
        Entry *iter = (*this)->table[row];
        while (NULL != iter) {
            Entry *next = iter->next;
            entry_free(iter);
            iter = next;
        }
    }

    free(*this);
    (*this) = NULL;
}
#+end_src

** Getting a Value for a Key

We then need to isolate a helper function to get the index for a given
hash code. Since our code makes sure there are 2^n buckets in the table,
we can use the fact ~hash % length == hash & (length - 1)~. Using
bitwise-and is faster than the modulo operator.

#+begin_src c
/* types.c */

static size_t indexFor(hash_t hash, size_t length) {
    return hash & (length - 1);
}
#+end_src

Now the process for obtaining the value for a given key is quite
straightforward traversing the linked list ("bucket") selected by that
index, and when finding that key, returning the associated value:

#+begin_src c
/* types.c */

Object* hashmap_get(HashMap *this, Object *key) {
    assert (NULL != this);

    hash_t h = hashCode(key);
    size_t index = indexFor(h, this->capacity);
    for (Entry *e = this->table[index]; e != NULL; e = e->next) {
        if (equals(key, e->key)) {
            return e->value;
        }
    }
    return NULL;
}
#+end_src

