html/comp-sci/lisp/mal-2.html

<div id="outline-container-org9911880" class="outline-5">
<h5 id="org9911880"><span class="section-number-5">5.1.1.1</span> Constructor</h5>
<div class="outline-text-5" id="text-5-1-1-1">
<p>
We have the usual boiler plate code for it, namely a constructor and
destructor.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">Entry</span>* <span class="org-function-name">entry_new</span>(<span class="org-type">Object</span> *<span class="org-variable-name">key</span>, <span class="org-type">Object</span> *<span class="org-variable-name">value</span>, <span class="org-type">hash_t</span> <span class="org-variable-name">hash</span>) {
    <span class="org-type">Entry</span> *<span class="org-variable-name">entry</span> = alloc(<span class="org-keyword">sizeof</span>(*entry));
    entry-&gt;key = key;
    entry-&gt;value = value;
    entry-&gt;next = <span class="org-constant">NULL</span>;
    entry-&gt;hash = hash;
    <span class="org-keyword">return</span> entry;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org62f756a" class="outline-5">
<h5 id="org62f756a"><span class="section-number-5">5.1.1.2</span> Destructor</h5>
<div class="outline-text-5" id="text-5-1-1-2">
<p>
The only nuance to the Entry data structure is, unlike a Cons cell, its
destructor will not recursively destroy its next Entry.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">void</span> <span class="org-function-name">entry_free</span>(<span class="org-type">Entry</span> **<span class="org-variable-name">entry</span>) {
    <span class="org-keyword">if</span> ((<span class="org-constant">NULL</span> == entry) || (<span class="org-constant">NULL</span> == *entry)) <span class="org-keyword">return</span>;

    free(*entry);
    (*entry) = <span class="org-constant">NULL</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd7d3f2c" class="outline-5">
<h5 id="orgd7d3f2c"><span class="section-number-5">5.1.1.3</span> Sorted Insertion</h5>
<div class="outline-text-5" id="text-5-1-1-3">
<p>
Given a pointer to (a pointer to) an entry, and an entry we wish to
insert into the linked list, insert the new entry in a manner that the
linked list is sorted by hash code.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>
<span class="org-type">void</span> <span class="org-function-name">entry_insert</span>(<span class="org-type">Entry</span> **<span class="org-variable-name">list</span>, <span class="org-type">Entry</span> *<span class="org-variable-name">entry</span>) {
    assert(<span class="org-constant">NULL</span> != entry);
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == list) <span class="org-keyword">return</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == *list) {
        (*list) = entry;
        entry-&gt;next = <span class="org-constant">NULL</span>;
        <span class="org-keyword">return</span>;
    } <span class="org-keyword">else</span> <span class="org-keyword">if</span> ((entry-&gt;hash) &lt;= ((*list)-&gt;hash)) {
        entry-&gt;next = (*list);
        (*list) = entry;
        <span class="org-keyword">return</span>;
    } <span class="org-keyword">else</span> {
        assert((entry-&gt;hash) &gt; ((*list)-&gt;hash));
        <span class="org-type">Entry</span> *<span class="org-variable-name">prev</span> = *item;
        <span class="org-type">Entry</span> *<span class="org-variable-name">e</span> = <span class="org-constant">NULL</span>;
        <span class="org-keyword">for</span> (e = prev-&gt;next; <span class="org-constant">NULL</span> != *e; e = e-&gt;next) {
            <span class="org-comment-delimiter">// </span><span class="org-comment">if (prev &lt; entry &lt;= e)</span>
            <span class="org-keyword">if</span> (((prev-&gt;hash) &lt; (entry-&gt;hash)) &amp;&amp;
                ((entry-&gt;hash) &lt;= (e-&gt;hash))) {
                prev-&gt;next = entry;
                entry-&gt;next = e;
                <span class="org-keyword">return</span>;
            }
            prev = e;
        }
        <span class="org-comment-delimiter">// </span><span class="org-comment">append at the end of the linked list</span>
        assert(<span class="org-constant">NULL</span> == e);
        assert(<span class="org-constant">NULL</span> != prev);
        prev-&gt;next = entry;
        entry-&gt;next = <span class="org-constant">NULL</span>;
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org9216829" class="outline-4">
<h4 id="org9216829"><span class="section-number-4">5.1.2</span> Hash Table</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
The Hash Map consists of an array of Entry pointers. We track how many
entries belong to the hash map in its <code>size</code> parameter; and when it
exceeds the <code>capacity</code>, we grow the number of buckets and rebalance.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-keyword">struct</span> <span class="org-type">HashMap</span> {
    <span class="org-type">Object</span> <span class="org-variable-name">header</span>;
    <span class="org-type">Entry</span> **<span class="org-variable-name">table</span>;
    <span class="org-type">size_t</span> <span class="org-variable-name">capacity</span>;
    <span class="org-type">size_t</span> <span class="org-variable-name">size</span>;
};
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd8565ad" class="outline-3">
<h3 id="orgd8565ad"><span class="section-number-3">5.2</span> Constructor</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The constructor expects no parameters. The default capacity for a hash
map would be 16, its initial size 0.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-preprocessor">#define</span> <span class="org-variable-name">INITIAL_HASH_MAP_CAPACITY</span> 16 <span class="org-comment-delimiter">/* </span><span class="org-comment">must be power of 2 </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">HashMap</span>* <span class="org-function-name">hashmap_new</span>() {
    <span class="org-type">HashMap</span> *<span class="org-variable-name">map</span> = alloc(<span class="org-keyword">sizeof</span>(*map));
    map-&gt;header.type = TYPE_HASH_MAP;
    map-&gt;capacity = INITIAL_HASH_MAP_CAPACITY;
    map-&gt;size = 0;
    map-&gt;table = alloc_array(<span class="org-keyword">sizeof</span>(<span class="org-keyword">struct</span> <span class="org-type">Entry</span>*), map-&gt;capacity);
    <span class="org-keyword">return</span> map;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org09ef54e" class="outline-3">
<h3 id="org09ef54e"><span class="section-number-3">5.3</span> Destructor</h3>
<div class="outline-text-3" id="text-5-3">
<p>
When we destroy a HashMap object, we also have to iteratively destroy
the table entries.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">void</span> <span class="org-function-name">hashmap_free</span>(<span class="org-type">HashMap</span> **<span class="org-variable-name">this</span>) {
    <span class="org-keyword">if</span> ((<span class="org-constant">NULL</span> == this) || (<span class="org-constant">NULL</span> == *this)) <span class="org-keyword">return</span>;

    <span class="org-keyword">for</span> (<span class="org-type">size_t</span> <span class="org-variable-name">row</span> = 0; row &lt; (*this)-&gt;capacity; row++) {
        <span class="org-type">Entry</span> *<span class="org-variable-name">iter</span> = (*this)-&gt;table[row];
        <span class="org-keyword">while</span> (<span class="org-constant">NULL</span> != iter) {
            <span class="org-type">Entry</span> *<span class="org-variable-name">next</span> = iter-&gt;next;
            entry_free(iter);
            iter = next;
        }
    }

    free(*this);
    (*this) = <span class="org-constant">NULL</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4b4a43" class="outline-3">
<h3 id="orgd4b4a43"><span class="section-number-3">5.4</span> Getting a Value for a Key</h3>
<div class="outline-text-3" id="text-5-4">
<p>
We then need to isolate a helper function to get the index for a given
hash code. Since our code makes sure there are 2<sup>n</sup> buckets in the table,
we can use the fact <code>hash % length == hash &amp; (length - 1)</code>. Using
bitwise-and is faster than the modulo operator.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-keyword">static</span> <span class="org-type">size_t</span> <span class="org-function-name">indexFor</span>(<span class="org-type">hash_t</span> <span class="org-variable-name">hash</span>, <span class="org-type">size_t</span> <span class="org-variable-name">length</span>) {
    <span class="org-keyword">return</span> hash &amp; (length - 1);
}
</pre>
</div>

<p>
Now the process for obtaining the value for a given key is quite
straightforward traversing the linked list ("bucket") selected by that
index, and when finding that key, returning the associated value:
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">Object</span>* <span class="org-function-name">hashmap_get</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>, <span class="org-type">Object</span> *<span class="org-variable-name">key</span>) {
    assert (<span class="org-constant">NULL</span> != this);

    <span class="org-type">hash_t</span> <span class="org-variable-name">h</span> = hashCode(key);
    <span class="org-type">size_t</span> <span class="org-variable-name">index</span> = indexFor(h, this-&gt;capacity);
    <span class="org-keyword">for</span> (<span class="org-type">Entry</span> *<span class="org-variable-name">e</span> = this-&gt;table[index]; e != <span class="org-constant">NULL</span>; e = e-&gt;next) {
        <span class="org-keyword">if</span> (equals(key, e-&gt;key)) {
            <span class="org-keyword">return</span> e-&gt;value;
        }
    }
    <span class="org-keyword">return</span> <span class="org-constant">NULL</span>;
}
</pre>
</div>
</div>
</div>
