comp-sci/lisp/mal-2.org
** Associating a Value for a Key

We associate a value to a key in a given hash map by finding the bucket
associated for the hash code for that key. First, we try finding the key
in that bucket of entries by simple traversal. If we're lucky, it's
already associated with a value. In that case, we just update the entry
to point to the new value, and return the old value.

But if that bucket has not been started (so it's a null pointer) /or/ if
the bucket does not contain the key, then we create a new entry, and
prepend it to that row of the table. Since no value is associated to the
key, we return a null pointer.

#+begin_src c
/* types.c */

#define CAPACITY_FACTOR 0.75

static void resize(HashMap *this, size_t new_capacity);

Object* hashmap_put(HashMap *this, Object *key, Object *value) {
    assert(NULL != this);

    hash_t h = hashCode(key);
    size_t index = indexFor(h, this->capacity);
    Entry *entry = this->table[index];
    if (NULL != entry) {
        // try updating the value associated to key, if key is present
        Entry *e = entry;
        while (e != NULL) {
            if ((e->hash == h) && equals(keys, e->key)) {
                Object *old_val = e->value;
                e->value = value;
                return old_val;
            }
            e = e->next;
        }
        // fall-through: no key associated with that value, then prepend entry
    }
    // key is not present, so add entry
    Entry *new_entry = entry_new(key, value, h);
    // entry_insert(&(this->table[index]), new_entry);
    new_entry->next = this->table[index];
    this->table[index] = new_entry;
    this->size++;

    if ((this->size) >= (size_t)((this->capacity)*CAPACITY_FACTOR)) {
        resize(this, 2*(this->capacity));
    }
    return NULL;
}
#+end_src

*** Resizing the Entry Table

The basic idea is to resize the hash map's underlying table by creating
a new array of entry pointers, then transfer the contents of the array,
free the old array of pointers (just the array). We'll also need to
update the table pointer, and the hash map's capacity.

#+begin_src c
/* types.c */

static void transfer(Entry **old_table, Entry **new_table,
                     size_t length, size_t new_length);

void resize(HashMap *this, size_t new_capacity) {
    if ((this->capacity) >= new_capacity) return;

    Entry **new_table = alloc_array(sizeof(struct Entry*), new_capacity);
    transfer(this->table, new_table, this->capacity, new_capacity);
    free(this->table);
    this->table = new_table;
    this->capacity = new_capacity;
}
#+end_src

*** Transferring Table Contents

Transferring the contents amounts to transferring rows in bucket ~i~,
for ~i=0~ to the number of buckets.

#+begin_src c
/* types.c */

static void transfer_rows(Entry *row, Entry **new_table, size_t new_length);

void transfer(Entry **old_table, Entry **new_table,
              size_t length, size_t new_length) {
    for(size_t i = 0; i < length; i++) {
        transfer_rows(old_table[i]; new_table, new_length);
    }
}

void transfer_rows(Entry *row, Entry **new_table, size_t new_length) {
    Entry *e = row;
    while (NULL != e) {
        Entry *next = e->next;
        size_t index = indexFor(e->hash, new_length);
        // entry_insert(&new_table[index], e);
        if (NULL == new_table[index]) {
            e->next = NULL;
        } else {
            e->next = new_table[index];
        }
        new_table[index] = e;
        e = next;
    }
}
#+end_src

** Removing a key from the Hash Map

If we want to disassociate a key from the hash map altogether (assuming
the hash map contains it), then we simply update the bucket containing
the associated hash.

Yes, I know about Linus Torvalds's commentary about using a double
pointer here, but I found it less clear after a second glance.

#+begin_src c
/* types.c */

void hashmap_remove(HashMap *this, Object *key) {
    if (NULL == this) return;
    hash_t h = hashCode(key);
    size_t index = indexFor(h, this->capacity);
    Entry *entry = this->table[index];
    Entry *prev = NULL;

    while (NULL != entry) {
        if ((entry->hash == h) && equals(entry->key, key)) {
            if (NULL == prev) {
                this->table[index] = entry->next;
            } else {
                prev->next = entry->next;
            }
            entry_free(&entry);
            this->size--;
            return;
        }
    }
}
#+end_src

