html/comp-sci/lisp/mal-2.html

<div id="outline-container-orgd5b13ba" class="outline-3">
<h3 id="orgd5b13ba"><span class="section-number-3">5.5</span> Associating a Value for a Key</h3>
<div class="outline-text-3" id="text-5-5">
<p>
We associate a value to a key in a given hash map by finding the bucket
associated for the hash code for that key. First, we try finding the key
in that bucket of entries by simple traversal. If we're lucky, it's
already associated with a value. In that case, we just update the entry
to point to the new value, and return the old value.
</p>

<p>
But if that bucket has not been started (so it's a null pointer) <i>or</i> if
the bucket does not contain the key, then we create a new entry, and
prepend it to that row of the table. Since no value is associated to the
key, we return a null pointer.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-preprocessor">#define</span> <span class="org-variable-name">CAPACITY_FACTOR</span> 0.75

<span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">resize</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>, <span class="org-type">size_t</span> <span class="org-variable-name">new_capacity</span>);

<span class="org-type">Object</span>* <span class="org-function-name">hashmap_put</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>, <span class="org-type">Object</span> *<span class="org-variable-name">key</span>, <span class="org-type">Object</span> *<span class="org-variable-name">value</span>) {
    assert(<span class="org-constant">NULL</span> != this);

    <span class="org-type">hash_t</span> <span class="org-variable-name">h</span> = hashCode(key);
    <span class="org-type">size_t</span> <span class="org-variable-name">index</span> = indexFor(h, this-&gt;capacity);
    <span class="org-type">Entry</span> *<span class="org-variable-name">entry</span> = this-&gt;table[index];
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> != entry) {
        <span class="org-comment-delimiter">// </span><span class="org-comment">try updating the value associated to key, if key is present</span>
        <span class="org-type">Entry</span> *<span class="org-variable-name">e</span> = entry;
        <span class="org-keyword">while</span> (e != <span class="org-constant">NULL</span>) {
            <span class="org-keyword">if</span> ((e-&gt;hash == h) &amp;&amp; equals(keys, e-&gt;key)) {
                <span class="org-type">Object</span> *<span class="org-variable-name">old_val</span> = e-&gt;value;
                e-&gt;value = value;
                <span class="org-keyword">return</span> old_val;
            }
            e = e-&gt;next;
        }
        <span class="org-comment-delimiter">// </span><span class="org-comment">fall-through: no key associated with that value, then prepend entry</span>
    }
    <span class="org-comment-delimiter">// </span><span class="org-comment">key is not present, so add entry</span>
    <span class="org-type">Entry</span> *<span class="org-variable-name">new_entry</span> = entry_new(key, value, h);
    <span class="org-comment-delimiter">// </span><span class="org-comment">entry_insert(&amp;(this-&gt;table[index]), new_entry);</span>
    new_entry-&gt;next = this-&gt;table[index];
    this-&gt;table[index] = new_entry;
    this-&gt;size++;

    <span class="org-keyword">if</span> ((this-&gt;size) &gt;= (<span class="org-type">size_t</span>)((this-&gt;capacity)*CAPACITY_FACTOR)) {
        resize(this, 2*(this-&gt;capacity));
    }
    <span class="org-keyword">return</span> <span class="org-constant">NULL</span>;
}
</pre>
</div>
</div>

<div id="outline-container-orgf137986" class="outline-4">
<h4 id="orgf137986"><span class="section-number-4">5.5.1</span> Resizing the Entry Table</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
The basic idea is to resize the hash map's underlying table by creating
a new array of entry pointers, then transfer the contents of the array,
free the old array of pointers (just the array). We'll also need to
update the table pointer, and the hash map's capacity.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">transfer</span>(<span class="org-type">Entry</span> **<span class="org-variable-name">old_table</span>, <span class="org-type">Entry</span> **<span class="org-variable-name">new_table</span>,
                     <span class="org-type">size_t</span> <span class="org-variable-name">length</span>, <span class="org-type">size_t</span> <span class="org-variable-name">new_length</span>);

<span class="org-type">void</span> <span class="org-function-name">resize</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>, <span class="org-type">size_t</span> <span class="org-variable-name">new_capacity</span>) {
    <span class="org-keyword">if</span> ((this-&gt;capacity) &gt;= new_capacity) <span class="org-keyword">return</span>;

    <span class="org-type">Entry</span> **<span class="org-variable-name">new_table</span> = alloc_array(<span class="org-keyword">sizeof</span>(<span class="org-keyword">struct</span> <span class="org-type">Entry</span>*), new_capacity);
    transfer(this-&gt;table, new_table, this-&gt;capacity, new_capacity);
    free(this-&gt;table);
    this-&gt;table = new_table;
    this-&gt;capacity = new_capacity;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org087e12d" class="outline-4">
<h4 id="org087e12d"><span class="section-number-4">5.5.2</span> Transferring Table Contents</h4>
<div class="outline-text-4" id="text-5-5-2">
<p>
Transferring the contents amounts to transferring rows in bucket <code>i</code>,
for <code>i=0</code> to the number of buckets.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">transfer_rows</span>(<span class="org-type">Entry</span> *<span class="org-variable-name">row</span>, <span class="org-type">Entry</span> **<span class="org-variable-name">new_table</span>, <span class="org-type">size_t</span> <span class="org-variable-name">new_length</span>);

<span class="org-type">void</span> <span class="org-function-name">transfer</span>(<span class="org-type">Entry</span> **<span class="org-variable-name">old_table</span>, <span class="org-type">Entry</span> **<span class="org-variable-name">new_table</span>,
              <span class="org-type">size_t</span> <span class="org-variable-name">length</span>, <span class="org-type">size_t</span> <span class="org-variable-name">new_length</span>) {
    <span class="org-keyword">for</span>(<span class="org-type">size_t</span> <span class="org-variable-name">i</span> = 0; i &lt; length; i++) {
        transfer_rows(old_table[i]; new_table, new_length);
    }
}

<span class="org-type">void</span> <span class="org-function-name">transfer_rows</span>(<span class="org-type">Entry</span> *<span class="org-variable-name">row</span>, <span class="org-type">Entry</span> **<span class="org-variable-name">new_table</span>, <span class="org-type">size_t</span> <span class="org-variable-name">new_length</span>) {
    <span class="org-type">Entry</span> *<span class="org-variable-name">e</span> = row;
    <span class="org-keyword">while</span> (<span class="org-constant">NULL</span> != e) {
        <span class="org-type">Entry</span> *<span class="org-variable-name">next</span> = e-&gt;next;
        <span class="org-type">size_t</span> <span class="org-variable-name">index</span> = indexFor(e-&gt;hash, new_length);
        <span class="org-comment-delimiter">// </span><span class="org-comment">entry_insert(&amp;new_table[index], e);</span>
        <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == new_table[index]) {
            e-&gt;next = <span class="org-constant">NULL</span>;
        } <span class="org-keyword">else</span> {
            e-&gt;next = new_table[index];
        }
        new_table[index] = e;
        e = next;
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb6dbe3c" class="outline-3">
<h3 id="orgb6dbe3c"><span class="section-number-3">5.6</span> Removing a key from the Hash Map</h3>
<div class="outline-text-3" id="text-5-6">
<p>
If we want to disassociate a key from the hash map altogether (assuming
the hash map contains it), then we simply update the bucket containing
the associated hash.
</p>

<p>
Yes, I know about Linus Torvalds's commentary about using a double
pointer here, but I found it less clear after a second glance.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">void</span> <span class="org-function-name">hashmap_remove</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>, <span class="org-type">Object</span> *<span class="org-variable-name">key</span>) {
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == this) <span class="org-keyword">return</span>;
    <span class="org-type">hash_t</span> <span class="org-variable-name">h</span> = hashCode(key);
    <span class="org-type">size_t</span> <span class="org-variable-name">index</span> = indexFor(h, this-&gt;capacity);
    <span class="org-type">Entry</span> *<span class="org-variable-name">entry</span> = this-&gt;table[index];
    <span class="org-type">Entry</span> *<span class="org-variable-name">prev</span> = <span class="org-constant">NULL</span>;

    <span class="org-keyword">while</span> (<span class="org-constant">NULL</span> != entry) {
        <span class="org-keyword">if</span> ((entry-&gt;hash == h) &amp;&amp; equals(entry-&gt;key, key)) {
            <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == prev) {
                this-&gt;table[index] = entry-&gt;next;
            } <span class="org-keyword">else</span> {
                prev-&gt;next = entry-&gt;next;
            }
            entry_free(&amp;entry);
            this-&gt;size--;
            <span class="org-keyword">return</span>;
        }
    }
}
</pre>
</div>
</div>
</div>
