comp-sci/lisp/mal-2.org
** Size of the Hash Map

The size of the hash map has been abstracted away to a helper function.
It just accesses the size field. For ~*this~ null pointers, it defaults
to zero.

#+begin_src c
/* types.c */

size_t hashmap_size(HashMap *this) {
    if (NULL == this) return 0;

    return this->size;
}
#+end_src

** Hash Code

We can implement the hashcode computation as treating it as a list of
key-value entries.

(N.B. Java computes the hash code of a HashMap by iterating over the
entry set, and using their hash code computation for a generic list.
See, e.g., [[https://github.com/openjdk/jdk/blob/jdk8-b120/jdk/src/share/classes/java/util/AbstractMap.java#L490-L496][AbstractMap::hashCode]] in JDK8).

#+begin_src c
static hash_t entry_hashCode(Entry *entry) {
    if (NULL == entry) return 0;
    else return hashCode(entry->key) ^ hashCode(entry->value);
}

hash_t hashmap_hashCode(HashMap *this) {
    hash_t h = 0;
    for (size_t row = 0; row < (this->capacity); row++) {
        for (Entry *e = (this->table[row]); NULL != e; e = e->next) {
            h += entry_hashCode(e);
        }
    }
    return h;
}
#+end_src

** Equality of Hash Maps

This is trickier, but basically checks if every key in the ~lhs~ map
appears in the ~rhs~ map, and if that key is associated to the same
values. And if they have the same size, then the two hash maps are
equal, and the method returns true. All other scenarios return false.

#+begin_src c
bool hashmap_equals(HashMap *lhs, HashMap *rhs) {
    if (lhs == rhs) return true;
    if (NULL == lhs) return false;
    if (NULL == rhs) return false;
    if ((lhs->size) != (rhs->size)) return false;

    for (size_t row = 0; row < (lhs->capacity); row++) {
        for (Entry *e = (lhs->table[row]); NULL != e; e = e->next) {
            if (!equals(e->value, hashmap_get(rhs, e->key))) {
                return false;
            }
        }
    }
    return true;
}
#+end_src

** Hash Table References
- [[http://coding-geek.com/how-does-a-hashmap-work-in-java/][How does a HashMap work in JAVA]]
  - OpenJDK's implementation changed from a linked list ([[https://github.com/openjdk/jdk/blob/jdk8-b01/jdk/src/share/classes/java/util/HashMap.java][jdk8-b01]]) to
    use a binary tree for buckets with 8 or more elements (by [[https://github.com/openjdk/jdk/blob/jdk8-b120/jdk/src/share/classes/java/util/HashMap.java][jdk8-b120]])
- Intel's [[https://github.com/oneapi-src/oneTBB/blob/b15aabb39a12a4dcddb6ee886265f2bf2f972650/include/oneapi/tbb/concurrent_unordered_map.h][~concurrent_unordered_map~]]
- Attractive Chaos's [[https://github.com/attractivechaos/klib/blob/master/khash.h][khash]]
  - [[https://attractivechaos.wordpress.com/2008/09/02/implementing-generic-hash-library-in-c/][Implementation Notes]]
  - [[https://attractivechaos.wordpress.com/2008/08/28/comparison-of-hash-table-libraries/][Comparison of Hash Table Libraries]]
- [[https://rcoh.me/posts/hash-map-analysis/][An Analysis of Hash Map Implementations in Popular Languages]]
- Common Lisp implementations all seem to use chaining
  - [[https://github.com/sbcl/sbcl/blob/44125975b4d69d0ac3e289a4f8064f70a4164bfb/src/code/target-hash-table.lisp#L341-L533][SBCL]]
  - [[https://github.com/Clozure/ccl/blob/c3b1e184539077d655b4b0cc1143ef6462f0d9b4/level-0/l0-hash.lisp#L426-L509][CCL]]
  - [[https://github.com/armedbear/abcl/blob/321bac94a35f410af2a6b21847fed64b67c5e022/src/org/armedbear/lisp/HashTable.java#L39][ABCL]]
