html/comp-sci/lisp/mal-2.html

<div id="outline-container-org790afa1" class="outline-3">
<h3 id="org790afa1"><span class="section-number-3">5.7</span> Size of the Hash Map</h3>
<div class="outline-text-3" id="text-5-7">
<p>
The size of the hash map has been abstracted away to a helper function.
It just accesses the size field. For <code>*this</code> null pointers, it defaults
to zero.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">size_t</span> <span class="org-function-name">hashmap_size</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>) {
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == this) <span class="org-keyword">return</span> 0;

    <span class="org-keyword">return</span> this-&gt;size;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org651d8d1" class="outline-3">
<h3 id="org651d8d1"><span class="section-number-3">5.8</span> Hash Code</h3>
<div class="outline-text-3" id="text-5-8">
<p>
We can implement the hashcode computation as treating it as a list of
key-value entries.
</p>

<p>
(N.B. Java computes the hash code of a HashMap by iterating over the
entry set, and using their hash code computation for a generic list.
See, e.g., <a href="https://github.com/openjdk/jdk/blob/jdk8-b120/jdk/src/share/classes/java/util/AbstractMap.java#L490-L496">AbstractMap::hashCode</a> in JDK8).
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-keyword">static</span> <span class="org-type">hash_t</span> <span class="org-function-name">entry_hashCode</span>(<span class="org-type">Entry</span> *<span class="org-variable-name">entry</span>) {
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == entry) <span class="org-keyword">return</span> 0;
    <span class="org-keyword">else</span> <span class="org-keyword">return</span> hashCode(entry-&gt;key) ^ hashCode(entry-&gt;value);
}

<span class="org-type">hash_t</span> <span class="org-function-name">hashmap_hashCode</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">this</span>) {
    <span class="org-type">hash_t</span> <span class="org-variable-name">h</span> = 0;
    <span class="org-keyword">for</span> (<span class="org-type">size_t</span> <span class="org-variable-name">row</span> = 0; row &lt; (this-&gt;capacity); row++) {
        <span class="org-keyword">for</span> (<span class="org-type">Entry</span> *<span class="org-variable-name">e</span> = (this-&gt;table[row]); <span class="org-constant">NULL</span> != e; e = e-&gt;next) {
            h += entry_hashCode(e);
        }
    }
    <span class="org-keyword">return</span> h;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge6dba8f" class="outline-3">
<h3 id="orge6dba8f"><span class="section-number-3">5.9</span> Equality of Hash Maps</h3>
<div class="outline-text-3" id="text-5-9">
<p>
This is trickier, but basically checks if every key in the <code>lhs</code> map
appears in the <code>rhs</code> map, and if that key is associated to the same
values. And if they have the same size, then the two hash maps are
equal, and the method returns true. All other scenarios return false.
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-comment-delimiter">/* </span><span class="org-comment">types.c </span><span class="org-comment-delimiter">*/</span>

<span class="org-type">bool</span> <span class="org-function-name">hashmap_equals</span>(<span class="org-type">HashMap</span> *<span class="org-variable-name">lhs</span>, <span class="org-type">HashMap</span> *<span class="org-variable-name">rhs</span>) {
    <span class="org-keyword">if</span> (lhs == rhs) <span class="org-keyword">return</span> <span class="org-constant">true</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == lhs) <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    <span class="org-keyword">if</span> (<span class="org-constant">NULL</span> == rhs) <span class="org-keyword">return</span> <span class="org-constant">false</span>;
    <span class="org-keyword">if</span> ((lhs-&gt;size) != (rhs-&gt;size)) <span class="org-keyword">return</span> <span class="org-constant">false</span>;

    <span class="org-keyword">for</span> (<span class="org-type">size_t</span> <span class="org-variable-name">row</span> = 0; row &lt; (lhs-&gt;capacity); row++) {
        <span class="org-keyword">for</span> (<span class="org-type">Entry</span> *<span class="org-variable-name">e</span> = (lhs-&gt;table[row]); <span class="org-constant">NULL</span> != e; e = e-&gt;next) {
            <span class="org-keyword">if</span> (<span class="org-negation-char">!</span>equals(e-&gt;value, hashmap_get(rhs, e-&gt;key))) {
                <span class="org-keyword">return</span> <span class="org-constant">false</span>;
            }
        }
    }
    <span class="org-keyword">return</span> <span class="org-constant">true</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdde3b96" class="outline-3">
<h3 id="orgdde3b96"><span class="section-number-3">5.10</span> Hash Table References</h3>
<div class="outline-text-3" id="text-5-10">
<ul class="org-ul">
<li><a href="http://coding-geek.com/how-does-a-hashmap-work-in-java/">How does a HashMap work in JAVA</a>
<ul class="org-ul">
<li>OpenJDK's implementation changed from a linked list (<a href="https://github.com/openjdk/jdk/blob/jdk8-b01/jdk/src/share/classes/java/util/HashMap.java">jdk8-b01</a>) to
use a binary tree for buckets with 8 or more elements (by <a href="https://github.com/openjdk/jdk/blob/jdk8-b120/jdk/src/share/classes/java/util/HashMap.java">jdk8-b120</a>)</li>
</ul></li>
<li>Intel's <a href="https://github.com/oneapi-src/oneTBB/blob/b15aabb39a12a4dcddb6ee886265f2bf2f972650/include/oneapi/tbb/concurrent_unordered_map.h"><code>concurrent_unordered_map</code></a></li>
<li>Attractive Chaos's <a href="https://github.com/attractivechaos/klib/blob/master/khash.h">khash</a>
<ul class="org-ul">
<li><a href="https://attractivechaos.wordpress.com/2008/09/02/implementing-generic-hash-library-in-c/">Implementation Notes</a></li>
<li><a href="https://attractivechaos.wordpress.com/2008/08/28/comparison-of-hash-table-libraries/">Comparison of Hash Table Libraries</a></li>
</ul></li>
<li><a href="https://rcoh.me/posts/hash-map-analysis/">An Analysis of Hash Map Implementations in Popular Languages</a></li>
<li>Common Lisp implementations all seem to use chaining
<ul class="org-ul">
<li><a href="https://github.com/sbcl/sbcl/blob/44125975b4d69d0ac3e289a4f8064f70a4164bfb/src/code/target-hash-table.lisp#L341-L533">SBCL</a></li>
<li><a href="https://github.com/Clozure/ccl/blob/c3b1e184539077d655b4b0cc1143ef6462f0d9b4/level-0/l0-hash.lisp#L426-L509">CCL</a></li>
<li><a href="https://github.com/armedbear/abcl/blob/321bac94a35f410af2a6b21847fed64b67c5e022/src/org/armedbear/lisp/HashTable.java#L39">ABCL</a></li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-02-24 Wed 22:03.</p>
</div>
</body>
</html>